// выражения
/*
 выражение всегда возвращает  значение
 Примеры:
 'abc' - 'abc'
 10  - 10
 5 + 2 - сумма 
 c = 10 - Мы переменной с присваиваем значение, в данном случае 10, но можно присвоить любой тип данных
 'Good' + 'Evening' - конкатенация
 a <= b || c !== d - логическое выражение true или false
 myFunction(c, d) - вызов функции, функция всегда возвращает значение

 
 Выражение с побочными действиями - это такие выражения, которые не только возвращают значение, но и выполняет другие действия
 Примеры:
 a = 5 - используем оператор присваивания, вернет значение 5, но кроме этого, мы можем обратиться к этой переменной позже, не только присвоили, но и можем использовать переменную позже
 b++ - Увеличиваем на один, допустим b = 6, результат будет 7, то есть это выражение вернет 7, кроме этого значение увеличено на 1 помимо того, что мы возвращаем значение выражения, мы еще увеличили на один
 myFunction(c, d) - функция с аргументами, внутри функции выполняются другие побочные действия, но главная цель функции - вернуть значение
 */
